Tekla.Structures.ModelInternal.GeometryImporter.ImportCylindricalSurfaceGeometry(Tekla.Structures.ModelInternal.PointList,System.Int32,System.Int32,System.Int32,Tekla.Structures.Geometry3d.Matrix)
Imports the cylindrical surface geometry section.
pointList: The points list.
pointsCount1: Number of points in the first lateral boundary.
pointsCount2: Number of points in the second lateral boundary.
pointIndex: The index of the first processed point.
matrixToCurrent: The matrix to transform global coordinates to current coordinates.
Returns: The geometry section node.